pikasTech/PikaPython/packages/machine/STM32/pika_hal_stm32_PWM.c
#define PWM_CMD_ENABLE      (RT_DEVICE_CTRL_BASE(PWM) + 0)
#define PWM_CMD_DISABLE     (RT_DEVICE_CTRL_BASE(PWM) + 1)
#define PWM_CMD_SET         (RT_DEVICE_CTRL_BASE(PWM) + 2)
#define PWM_CMD_GET         (RT_DEVICE_CTRL_BASE(PWM) + 3)
#define PWMN_CMD_ENABLE     (RT_DEVICE_CTRL_BASE(PWM) + 4)
#define PWMN_CMD_DISABLE    (RT_DEVICE_CTRL_BASE(PWM) + 5)
#define PWM_CMD_SET_PERIOD  (RT_DEVICE_CTRL_BASE(PWM) + 6)
#define PWM_CMD_SET_PULSE   (RT_DEVICE_CTRL_BASE(PWM) + 7)
#define PWM_CMD_SET_DEAD_TIME  (RT_DEVICE_CTRL_BASE(PWM) + 8)
#define PWM_CMD_SET_PHASE   (RT_DEVICE_CTRL_BASE(PWM) + 9)
#define PWM_CMD_ENABLE_IRQ  (RT_DEVICE_CTRL_BASE(PWM) + 10)
#define PWM_CMD_DISABLE_IRQ  (RT_DEVICE_CTRL_BASE(PWM) + 11)

static rt_err_t drv_pwm_control(struct rt_device_pwm *device, int cmd, void *arg)
{
    struct rt_pwm_configuration *configuration = (struct rt_pwm_configuration *)arg;
    TIM_HandleTypeDef *htim = (TIM_HandleTypeDef *)device->parent.user_data;

    switch (cmd)
    {
    case PWM_CMD_ENABLE:
        return drv_pwm_enable(htim, configuration, RT_TRUE);
    case PWM_CMD_DISABLE:
        return drv_pwm_enable(htim, configuration, RT_FALSE);
    case PWM_CMD_SET:
        return drv_pwm_set(htim, configuration);
    case PWM_CMD_SET_PERIOD:
        return drv_pwm_set_period(htim, configuration);
    case PWM_CMD_SET_PULSE:
        return drv_pwm_set_pulse(htim, configuration);
    case PWM_CMD_GET:
        return drv_pwm_get(htim, configuration);
    default:
        return -RT_EINVAL;
    }
}

#if defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32F4) || defined(SOC_SERIES_STM32L4)
static uint32_t get_pwm_pin_alternate(rt_base_t pin){
#ifdef BSP_USING_PWM1
    switch((uintptr_t)PIN_STPORT(pin)){
        case (uintptr_t)GPIOA:
            switch(PIN_NO(pin)){
                case 8:
                case 9:
                case 10:
                case 11:
                    return GPIO_AF1_TIM1;
            }
            break;
    }
#endif

#ifdef BSP_USING_PWM2
    switch((uintptr_t)PIN_STPORT(pin)){
        case (uintptr_t)GPIOA:
            switch(PIN_NO(pin)){
                case 0:
                case 1:
                case 2:
                case 3:
                    return GPIO_AF1_TIM2;
            }
            break;
    }
#endif

#ifdef BSP_USING_PWM3
    switch((uintptr_t)PIN_STPORT(pin)){
        case (uintptr_t)GPIOA:
            switch(PIN_NO(pin)){
                case 6:
                case 7:
                    return GPIO_AF2_TIM3;
            }
            break;
        case (uintptr_t)GPIOB:
            switch(PIN_NO(pin)){
                case 0:
                case 1:
                    return GPIO_AF2_TIM3;
            }
            break;
    }
#endif

#ifdef BSP_USING_PWM4
    switch((uintptr_t)PIN_STPORT(pin)){
        case (uintptr_t)GPIOB:
            switch(PIN_NO(pin)){
                case 6:
                case 7:
                case 8:
                case 9:
                    return GPIO_AF2_TIM4;
            }
            break;
    }
#endif
    return -1;  // Returning -1 for error cases as NULL for int return type doesn't make sense
}
#endif

static void pwm_pin_init(struct stm32_pwm* device){
    mp_hal_gpio_clock_enable(PIN_STPORT(device->pin));
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = PIN_STPIN(device->pin);
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
#if defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32F4) || defined(SOC_SERIES_STM32L4)
    GPIO_InitStruct.Alternate = get_pwm_pin_alternate(device->pin);
#endif
    HAL_GPIO_Init(PIN_STPORT(device->pin), &GPIO_InitStruct);
}

static rt_err_t stm32_hw_pwm_init(struct stm32_pwm *device)
{
    rt_err_t result = RT_EOK;
    TIM_HandleTypeDef *tim = RT_NULL;
    TIM_MasterConfigTypeDef master_config = {0};
    TIM_ClockConfigTypeDef clock_config = {0};

    RT_ASSERT(device != RT_NULL);

    tim = (TIM_HandleTypeDef *)&device->tim_handle;

    /* configure the timer to pwm mode */
    tim->Init.Prescaler = 0;
    tim->Init.CounterMode = TIM_COUNTERMODE_UP;
    tim->Init.Period = 0;
    tim->Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
#if defined(SOC_SERIES_STM32F1) || defined(SOC_SERIES_STM32L4)
    tim->Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
#endif
    if (HAL_TIM_Base_Init(tim) != HAL_OK)
    {
        LOG_E("%s pwm init failed", device->name);
        result = -RT_ERROR;
        goto __exit;
    }

    stm32_tim_enable_clock(tim);

    clock_config.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    if (HAL_TIM_ConfigClockSource(tim, &clock_config) != HAL_OK)
    {
        LOG_E("%s clock init failed", device->name);
        result = -RT_ERROR;
        goto __exit;
    }

    if (HAL_TIM_PWM_Init(tim) != HAL_OK)
    {
        LOG_E("%s pwm init failed", device->name);
        result = -RT_ERROR;
        goto __exit;
    }

    if(IS_TIM_MASTER_INSTANCE(tim->Instance))
    {
        master_config.MasterOutputTrigger = TIM_TRGO_RESET;
        master_config.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
        if (HAL_TIMEx_MasterConfigSynchronization(tim, &master_config) != HAL_OK)
        {
            LOG_E("%s master config failed", device->name);
            result = -RT_ERROR;
            goto __exit;
        }
    }

    TIM_OC_InitTypeDef oc_config = {0};
    oc_config.OCMode = TIM_OCMODE_PWM1;
    oc_config.Pulse = 0;
    oc_config.OCPolarity = TIM_OCPOLARITY_HIGH;
    oc_config.OCFastMode = TIM_OCFAST_DISABLE;
    oc_config.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    oc_config.OCIdleState  = TIM_OCIDLESTATE_RESET;

    /* config pwm channel */
    if (device->channel & 0x01)
    {
        if (HAL_TIM_PWM_ConfigChannel(tim, &oc_config, TIM_CHANNEL_1) != HAL_OK)
        {
            LOG_E("%s channel1 config failed", device->name);
            result = -RT_ERROR;
            goto __exit;
        }
    }

    if (device->channel & 0x02)
    {
        if (HAL_TIM_PWM_ConfigChannel(tim, &oc_config, TIM_CHANNEL_2) != HAL_OK)
        {
            LOG_E("%s channel2 config failed", device->name);
            result = -RT_ERROR;
            goto __exit;
        }
    }

    if (device->channel & 0x04)
    {
        if (HAL_TIM_PWM_ConfigChannel(tim, &oc_config, TIM_CHANNEL_3) != HAL_OK)
        {
            LOG_E("%s channel3 config failed", device->name);
            result = -RT_ERROR;
            goto __exit;
        }
    }

    if (device->channel & 0x08)
    {
        if (HAL_TIM_PWM_ConfigChannel(tim, &oc_config, TIM_CHANNEL_4) != HAL_OK)
        {
            LOG_E("%s channel4 config failed", device->name);
            result = -RT_ERROR;
            goto __exit;
        }
    }

    /* pwm pin configuration */
    pwm_pin_init(device);

    /* enable update request source */
    __HAL_TIM_URS_ENABLE(tim);

__exit:
    return result;
}

#define PWM_CH1 0
#define PWM_CH2 1
#define PWM_CH3 2
#define PWM_CH4 3

int get_pwm_channel(rt_base_t pin) {
    switch ((uintptr_t)PIN_STPORT(pin)) {
        case (uintptr_t)GPIOA:
            switch (PIN_NO(pin)) {
                case 8:
                case 0:
                case 6:
                case 4:
                    return PWM_CH1;

                case 9:
                case 1:
                case 7:
                    return PWM_CH2;

                case 10:
                case 2:
                    return PWM_CH3;

                case 11:
                case 3:
                    return PWM_CH4;
            }
            break;

        case (uintptr_t)GPIOB:
            switch (PIN_NO(pin)) {
                case 6:
                    return PWM_CH1;

                case 7:
                    return PWM_CH2;

                case 8:
                    return PWM_CH3;

                case 9:
                case 0:
                case 1:
                    return PWM_CH4;
            }
            break;

        case (uintptr_t)GPIOD:
            switch (PIN_NO(pin)) {
                case 0:
                    return PWM_CH1;

                case 1:
                    return PWM_CH2;
            }
            break;
    }
    /* Channel not match */
    return -1;
}

