pikasTech/PikaPython/packages/machine/STM32/pika_hal_stm32_PWM.c
static int get_pwm_index(rt_base_t pin) {

#ifdef BSP_USING_PWM1
    switch((uintptr_t)PIN_STPORT(pin)){
        case (uintptr_t)GPIOA:
            switch(PIN_NO(pin)){
                case 8:
                case 9:
                case 10:
                case 11:
                    return PWM1_INDEX;
            }
            break;
    }
#endif

#ifdef BSP_USING_PWM2
    switch((uintptr_t)PIN_STPORT(pin)){
        case (uintptr_t)GPIOA:
            switch(PIN_NO(pin)){
                case 0:
                case 1:
                case 2:
                case 3:
                    return PWM2_INDEX;
            }
            break;
    }
#endif

#ifdef BSP_USING_PWM3
    switch((uintptr_t)PIN_STPORT(pin)){
        case (uintptr_t)GPIOA:
            switch(PIN_NO(pin)){
                case 6:
                case 7:
                    return PWM3_INDEX;
            }
            break;
        case (uintptr_t)GPIOB:
            switch(PIN_NO(pin)){
                case 0:
                case 1:
                    return PWM3_INDEX;
            }
            break;
    }
#endif

#ifdef BSP_USING_PWM4
    switch((uintptr_t)PIN_STPORT(pin)){
        case (uintptr_t)GPIOB:
            switch(PIN_NO(pin)){
                case 6:
                case 7:
                case 8:
                case 9:
                    return PWM4_INDEX;
            }
            break;
    }
#endif
    return -1;  // Returning -1 for error cases as NULL for int return type doesn't make sense
}

static int stm32_pwm_set_channel(rt_base_t pin)
{
    int channel = get_pwm_channel(pin);
    int PWMX_INDEX = get_pwm_index(pin);

    if (PWMX_INDEX != -1 && channel != -1)
    {
        stm32_pwm_obj[PWMX_INDEX].channel |= 1 << channel;
        return 0;
    }
    return -1; // Unknown pin number or PWM not defined
}

static rt_err_t rt_device_pwm_register(struct rt_device_pwm *device, const char *name, const struct rt_pwm_ops *ops, const void *user_data)
{
    rt_err_t result = RT_EOK;

    rt_memset(device, 0, sizeof(struct rt_device_pwm));

#ifndef PIKA_HAL
#ifdef RT_USING_DEVICE_OPS
    device->parent.ops = &pwm_device_ops;
#else
    device->parent.init = RT_NULL;
    device->parent.open = RT_NULL;
    device->parent.close = RT_NULL;
    device->parent.read  = _pwm_read;
    device->parent.write = _pwm_write;
    device->parent.control = _pwm_control;
#endif /* RT_USING_DEVICE_OPS */
#endif

    device->parent.type         = RT_Device_Class_PWM;
    device->ops                 = ops;
    device->parent.user_data    = (void *)user_data;

#ifndef PIKA_HAL
    result = rt_device_register(&device->parent, name, RT_DEVICE_FLAG_RDWR);
#endif
    return result;
}

static volatile int stm32_pwm_inited = 0;
static int stm32_pwm_init(void)
{
    int i = 0;
    int result = RT_EOK;

    for (i = 0; i < sizeof(stm32_pwm_obj) / sizeof(stm32_pwm_obj[0]); i++)
    {
        LOG_D("%s init success", stm32_pwm_obj[i].name);

        /* register pwm device */
        if (rt_device_pwm_register(&stm32_pwm_obj[i].pwm_device, stm32_pwm_obj[i].name, &drv_ops, &stm32_pwm_obj[i].tim_handle) == RT_EOK)
        {
            LOG_D("%s register success", stm32_pwm_obj[i].name);
        }
        else
        {
            LOG_E("%s register failed", stm32_pwm_obj[i].name);
            result = -RT_ERROR;
        }
//        /* pwm init */
//        if (stm32_hw_pwm_init(&stm32_pwm_obj[i]) != RT_EOK)
//        {
//            LOG_E("%s init failed", stm32_pwm_obj[i].name);
//            result = -RT_ERROR;
//            goto __exit;
//        }
    }

__exit:
    return result;
}

#ifndef PIKA_HAL
INIT_DEVICE_EXPORT(stm32_pwm_init);
#endif

typedef struct platform_PWM {
    struct stm32_pwm* pwm_obj;
    struct rt_pwm_configuration pwm_configure;
} platform_PWM;

int pika_hal_platform_PWM_open(pika_dev* dev, char* name) {
    if (!stm32_pwm_inited){
        stm32_pwm_inited = 1;
        stm32_pwm_init();
    }
    rt_base_t pin = _stm32_pin_get(name);
    if(pin < 0){
        pika_platform_printf("PWM Error: Pin %s not supported\n", name);
        return -1;
    }
    int pwm_index = get_pwm_index(pin);
    if(pwm_index < 0){
        pika_platform_printf("PWM Error: Pin %s not supported\n", name);
        return -1;
    }
    int ret = stm32_pwm_set_channel(pin);
    if(ret < 0){
        pika_platform_printf("PWM Error: Pin %s not supported\n", name);
        return -1;
    }
    platform_PWM* pwm = pikaMalloc(sizeof(platform_PWM));
    memset(pwm, 0, sizeof(platform_PWM));
    pwm->pwm_obj = &stm32_pwm_obj[pwm_index];
    pwm->pwm_obj->pin = pin;
    pwm->pwm_configure.channel = get_pwm_channel(pin) + 1;
    dev->platform_data = pwm;
    return 0;
}

int pika_hal_platform_PWM_close(pika_dev* dev) {
    platform_PWM* pwm = (platform_PWM*)dev->platform_data;
    if(NULL != pwm){
        pikaFree(pwm, sizeof(platform_PWM));
        dev->platform_data = NULL;
    }
    return 0;
}

int pika_hal_platform_PWM_read(pika_dev* dev, void* buf, size_t count) {
    return -1;
}

int pika_hal_platform_PWM_write(pika_dev* dev, void* buf, size_t count) {
    return -1;
}

int pika_hal_platform_PWM_ioctl_config(pika_dev* dev,
                                       pika_hal_PWM_config* cfg) {
    platform_PWM* pwm = (platform_PWM*)dev->platform_data;
    pwm->pwm_configure.period = cfg->period;
    pwm->pwm_configure.pulse = cfg->duty;
    if (dev->is_enabled){
        drv_pwm_control(&pwm->pwm_obj->pwm_device, PWM_CMD_SET, &pwm->pwm_configure);
    }
    return 0;
}

int pika_hal_platform_PWM_ioctl_enable(pika_dev* dev) {
    platform_PWM* pwm = (platform_PWM*)dev->platform_data;
    if (!dev->is_enabled){
        stm32_hw_pwm_init(pwm->pwm_obj);
        drv_pwm_control(&pwm->pwm_obj->pwm_device, PWM_CMD_SET, &pwm->pwm_configure);
        drv_pwm_control(&pwm->pwm_obj->pwm_device, PWM_CMD_ENABLE, &pwm->pwm_configure);
    }
    return 0;
}

int pika_hal_platform_PWM_ioctl_disable(pika_dev* dev) {
    platform_PWM* pwm = (platform_PWM*)dev->platform_data;
    drv_pwm_control(&pwm->pwm_obj->pwm_device, PWM_CMD_DISABLE, &pwm->pwm_configure);
    return 0;
}

#endif /* BSP_USING_PWM */
